src/cfe/КСП/InformationRegisters/КСП_ВыставленныеСчетаПоСтрокамЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_ВыставленныеСчетаПоСтрокамЗаказа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выставлено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтрокиЗаказа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/CommonModules/СчетНаОплатуКлиентуЛокализация/Ext/Module.bsl
&Вместо("ОбработкаПроведения")
Процедура КСП_ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	Движения = Объект.Движения;
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
	// Движения
	// РС КСП_ВыставленныеСчетаПоСтрокамЗаказа
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		КСП_ДвиженияРСКСП_ВыставленныеСчетаПоСтрокамЗаказа(Объект, Движения, ДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры

Процедура КСП_ДвиженияРСКСП_ВыставленныеСчетаПоСтрокамЗаказа(Знач Объект, Движения, Знач ДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ВЫРАЗИТЬ(&ЗаказКлиента КАК Документ.ЗаказКлиента) КАК Заказ,
		//|	&СчетНаОплату КАК Счет,
		//|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		//|	ЗаказКлиентаТовары.КСП_ИдентификаторСтрокиЗаказа КАК ИдентификаторСтрокиЗаказа,
		//|	ЗаказКлиентаТовары.Количество КАК Заказано,
		//|	ЗаказКлиентаТовары.СуммаСНДС КАК Выставлено // TODO Спросить что за поле
		//|ИЗ
		//|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КСП_ВыставленныеСчетаПоСтрокамЗаказа КАК КСП_ВыставленныеСчетаПоСтрокамЗаказа
		//|		ПО ЗаказКлиентаТовары.Ссылка = КСП_ВыставленныеСчетаПоСтрокамЗаказа.Заказ
		//|			И ЗаказКлиентаТовары.Номенклатура = КСП_ВыставленныеСчетаПоСтрокамЗаказа.Номенклатура
		//|			И ЗаказКлиентаТовары.КСП_ИдентификаторСтрокиЗаказа = КСП_ВыставленныеСчетаПоСтрокамЗаказа.ИдентификаторСтрокиЗаказа
		//|			И (КСП_ВыставленныеСчетаПоСтрокамЗаказа.Счет <> &СчетНаОплату)
		//|ГДЕ
		//|	НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
		//|	И ЗаказКлиентаТовары.Ссылка.Проведен
		//|	И ЗаказКлиентаТовары.Ссылка = ВЫРАЗИТЬ(&ЗаказКлиента КАК Документ.ЗаказКлиента)
		////|	И ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
		////|	И КСП_ВыставленныеСчетаПоСтрокамЗаказа.Номенклатура ЕСТЬ NULL
		//
		//|";

		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&ЗаказКлиента КАК Документ.ЗаказКлиента) КАК Заказ,
		|	&СчетНаОплату КАК Счет,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.КСП_ИдентификаторСтрокиЗаказа КАК ИдентификаторСтрокиЗаказа,
		|	СУММА(ЗаказКлиентаТовары.Количество) КАК Заказано,
		|	СУММА(&ПроцентОплаты * ЗаказКлиентаТовары.СуммаСНДС) КАК Выставлено,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК Сумма,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	НЕ ЗаказКлиентаТовары.Ссылка.ПометкаУдаления
		|	И ЗаказКлиентаТовары.Ссылка.Проведен
		|	И ЗаказКлиентаТовары.Ссылка = (ВЫРАЗИТЬ(&ЗаказКлиента КАК Документ.ЗаказКлиента))
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.КСП_ИдентификаторСтрокиЗаказа,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.СуммаСНДС,
		|	ЗаказКлиентаТовары.Характеристика";

	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("СчетНаОплату", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПроцентОплаты", Объект.Ссылка.СуммаДокумента/Объект.ДокументОснование.СуммаДокумента);
	
	ВыборкаДвижений = Запрос.Выполнить().Выбрать();
	
	Движения.КСП_ВыставленныеСчетаПоСтрокамЗаказа.Записывать = Истина;
	Движения.КСП_ВыставленныеСчетаПоСтрокамЗаказа.Очистить();
	Пока ВыборкаДвижений.Следующий() Цикл
		Движение = Движения.КСП_ВыставленныеСчетаПоСтрокамЗаказа.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДвижений);
	КонецЦикла;

КонецПроцедуры
